function main() {
    $('.button').hide();
    $('.button').fadeIn(2000);
    $('h1').hide();
    $('h1').fadeIn(1000);


    //Материальное требование
   material.onclick = function() {
    //$("#mt").on('click', funtion() {      пробовал jquery

        var n = parseInt(prompt('Введите сумму иска '));

        if (n<=100000) {
          if(n*0.04 < 2000) {
          alert('Применяется минимальный размер госпошлины 2000 рублей');
          } else {
	          alert('Госпошлина составит '+ n + ' * 4%' + ' = ' + n*0.04);
          }

        } else if (n>100000 && n<=200000) {
	        alert('Размер госпошлины составит  ' + '4 000 рублей + 3% *'+ (n-100000) + ' = ' + (4000+0.03*(n-100000)) + ' рублей');

        } else if (n>200000 && n<=1000000) {
	        alert('Госпошлина = 7000 рублей * 2% * ' + (n-200000) + ' рублей' + ' = ' + (7000+0.02*(n-200000)) + ' рублей');

        } else if (n>1000000 && n<=2000000) {
	        alert('Госпошлина = 23 000 рублей + 1 % * '+ (n-1000000) + ' рублей = ' + (23000+0.01*(n-1000000)) + ' рублей')

        } else if (n>2000000) {
	        if(33000+0.005*(n-2000000)>=200000) {
	        alert('200000 рублей');
        } else {
            alert('Госпошлина = 33 000 рублей + 0,5% * ' + (n-2000000) + ' рублей ' + ' = ' + (33000+0.005*(n-2000000)) + ' рублей');
	    }
    }
    //);        пробовал jquery

 //Нематериальное требование
    nonMaterial.onclick = function () {
	  alert('Госпошлина составит 4000 рублей');
      }
    }
}

$(document).ready(main);
